//---------------------------------------------------------------------------
#ifndef ST_API_H
#define ST_API_H
#include <windows.h>
#include <math.h>
#include <winsock2.h>
#include <ws2tcpip.h>

#define DEST_STREAM_PORT 1457
#define DEST_PKT_PORT 1456
#define ST_PORT 1456

#define ST_IP_ADDR "192.168.1.31"

#define FRAMECAM_MCAST_Group    "239.255.0.1"  ///< MCAST группа обычных камер
#define SYNCRO_MCAST_GROUP      "239.255.0.2"  ///< MCAST группа синхронизатора
#define UZ_MCAST_GROUP          "239.255.0.3"  ///< MCAST группа ультразвуковых лыж
#define LINCAM_MCAST_GROUP      "239.255.0.4"  ///< MCAST группа линейных камер

#define BASE_PORT	4300

#define STREAM_DATA_PORT	(BASE_PORT + 11)   ///<
#define DATA_PORT	(BASE_PORT + 12)  		   ///< Идентификатор данных от стойки
#define CONF_PORT   (BASE_PORT + 13)  		   ///< Идентификатор настроек от стойки
#define MAC_CONF_PORT (BASE_PORT + 14)
#define SYNC_DATA_PORT (BASE_PORT + 15)  	  ///< Идентификатор данных от синхронизатора

#define CONF_DISABLE	0			///< Синхронизация выключена
#define CONF_USER		3			///< Синхронизация пользовательская
#define CONF_1MM		4			///< Синхронизация 1мм
#define CONF_5MM		5			///< Синхронизация 5мм
#define CONF_50MM		6			///< Синхронизация 50мм
#define CONF_100MM		7			///< Синхронизация 100мм


void InitTimeout(void);
void TestTimeout(void);
void delay(unsigned int ms);
//void WaitVSync(void);

#define CMD_ScanA(Proc) CMD_Set_B(Proc)
#define CMD_ScanB(Proc) CMD_Set_A(Proc)

/*!
	\union SyncGroup
	\brief Структура, описывающая доступ к группам синхронизации

	 Значения битов:
	-	000	Отключена
	-	001	Резерв (отключена)
	-	010	2мм
	-	011	User*1мм
	-	100	1мм 
	-	101	5мм 
	-	110	50мм
	-	111	100мм

*/
typedef union {
	struct {
		unsigned
            	grp_0:3, ///<	Выходы синхронизатора 1-4
		 	   	grp_1:3, ///<	Выходы синхронизатора 5-8
			   	grp_2:3, ///<	Выходы синхронизатора 9-12
				grp_3:3, ///<	Выходы синхронизатора 13-16
				grp_4:3, ///<	Выходы синхронизатора 17-20
				grp_5:3, ///<	Выходы синхронизатора 21-24
				grp_6:3, ///<	Выходы синхронизатора 25-28
				grp_7:3; ///<	Выходы синхронизатора 29-32
		} data;
	unsigned all;     ///<  Доступ к членам групп одним двойным словом
    unsigned char c[4]; ///< Побайтовый доступ
} SyncGroup;

#pragma pack(push)
#pragma pack(1)

#define Uint32 unsigned


struct POWER_CTRL_BITS {          // bits   description
   Uint32 sw0:1;             // 0      
   Uint32 on0:1;             // 1      
   Uint32 sw1:1;             // 2      
   Uint32 on1:1;             // 3      
   Uint32 sw2:1;             // 4
   Uint32 on2:1;             // 5      
   Uint32 sw3:1;             // 6      
   Uint32 on3:1;             // 7      
   Uint32 sw4:1;             // 8      
   Uint32 on4:1;             // 9      
   Uint32 sw5:1;             // 10      
   Uint32 on5:1;             // 11      
   Uint32 sw6:1;             // 12      
   Uint32 on6:1;             // 13      
   Uint32 sw7:1;             // 14      
   Uint32 on7:1;             // 15      
   Uint32 pwr0:1;            // 16      
   Uint32 pwr1:1;            // 17      
   Uint32 uval0:1;			 // 18
   Uint32 uval1:1;			 // 19
   Uint32 reserved1:7;		 // 20:26
   Uint32 led:1;
   Uint32 reserved2:4;		 // 28:31
};

typedef union POWER_CTRL_REG_ {
   Uint32               all;
   struct POWER_CTRL_BITS   bit;
} POWER_CTRL_REG;

/*!
	\brief Статическая структура для формирования команд в ультразвуковую лыжу для каналов на базе С64хх
*/
static struct {
    unsigned long cmd;		///< код команды
    unsigned short size;    ///< размер командного пакета
    unsigned long addr;     ///< адрес записи командного пакета
    unsigned long data[1024]; ///< данные 
} pkt;

/*!
	\brief Статическая структура для формирования команд в ультразвуковую лыжу для каналов на базе С54хх
*/
static struct {
    unsigned long cmd;		///< код команды
    unsigned short size;	///< размер командного пакета
    unsigned short addr;	///< адрес записи командного пакета
    unsigned short data[1024]; ///< данные 
} pkt16;


/*!
	\struct ch_setup
